OpenFOAM-v2112/tutorials/heatTransfer/buoyantPimpleFoam/hotRoomWithThermalShell/system/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches             (ceiling);

boundary
{
    side1
    {
        type                patch;
        ownerPolyPatch      ceiling;
        neighbourPolyPatch  fixedWall1;
    }

    side2
    {
        type                patch;
        ownerPolyPatch      ceiling;
        neighbourPolyPatch  fixedWall2;
    }

    side3
    {
        type                patch;
        ownerPolyPatch      ceiling;
        neighbourPolyPatch  fixedWall3;
    }

    side4
    {
        type                patch;
        ownerPolyPatch      ceiling;
        neighbourPolyPatch  fixedWall4;
    }
}


// ************************************************************************** //
